data/raw_bench/800_output.txt
Running 30s test @ http://10.99.59.146:8080/wrk2-api/home-timeline/read
  4 threads and 200 connections

  Thread calibration: mean lat.: 0.608ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.586ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.619ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.610ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://10.99.59.146:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   584.88us  107.01us   0.87ms   72.52%
    Req/Sec   209.82    147.55   600.00     72.36%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  576.00us
 75.000%  647.00us
 90.000%  715.00us
 99.000%    0.87ms
 99.900%    1.22ms
 99.990%    1.57ms
 99.999%    3.81ms
100.000%    3.81ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.336     0.000000            1         1.00
       0.464     0.100000         1617         1.11
       0.495     0.200000         3187         1.25
       0.522     0.300000         4786         1.43
       0.549     0.400000         6373         1.67
       0.576     0.500000         7995         2.00
       0.589     0.550000         8764         2.22
       0.603     0.600000         9577         2.50
       0.616     0.650000        10319         2.86
       0.632     0.700000        11133         3.33
       0.647     0.750000        11925         4.00
       0.655     0.775000        12322         4.44
       0.664     0.800000        12698         5.00
       0.675     0.825000        13117         5.71
       0.686     0.850000        13483         6.67
       0.701     0.875000        13909         8.00
       0.707     0.887500        14083         8.89
       0.715     0.900000        14282        10.00
       0.724     0.912500        14479        11.43
       0.734     0.925000        14689        13.33
       0.745     0.937500        14872        16.00
       0.752     0.943750        14983        17.78
       0.758     0.950000        15079        20.00
       0.766     0.956250        15182        22.86
       0.776     0.962500        15272        26.67
       0.786     0.968750        15370        32.00
       0.793     0.971875        15418        35.56
       0.800     0.975000        15470        40.00
       0.808     0.978125        15521        45.71
       0.816     0.981250        15567        53.33
       0.828     0.984375        15617        64.00
       0.836     0.985938        15641        71.11
       0.847     0.987500        15664        80.00
       0.861     0.989062        15689        91.43
       0.875     0.990625        15717       106.67
       0.888     0.992188        15739       128.00
       0.897     0.992969        15753       142.22
       0.906     0.993750        15763       160.00
       0.917     0.994531        15776       182.86
       0.938     0.995313        15789       213.33
       0.965     0.996094        15801       256.00
       0.991     0.996484        15807       284.44
       1.022     0.996875        15813       320.00
       1.036     0.997266        15819       365.71
       1.063     0.997656        15825       426.67
       1.148     0.998047        15832       512.00
       1.164     0.998242        15836       568.89
       1.170     0.998437        15839       640.00
       1.187     0.998633        15841       731.43
       1.213     0.998828        15845       853.33
       1.242     0.999023        15847      1024.00
       1.284     0.999121        15849      1137.78
       1.287     0.999219        15851      1280.00
       1.289     0.999316        15853      1462.86
       1.289     0.999414        15853      1706.67
       1.316     0.999512        15855      2048.00
       1.386     0.999561        15856      2275.56
       1.386     0.999609        15856      2560.00
       1.388     0.999658        15857      2925.71
       1.413     0.999707        15858      3413.33
       1.425     0.999756        15859      4096.00
       1.425     0.999780        15859      4551.11
       1.425     0.999805        15859      5120.00
       1.572     0.999829        15860      5851.43
       1.572     0.999854        15860      6826.67
       1.708     0.999878        15861      8192.00
       1.708     0.999890        15861      9102.22
       1.708     0.999902        15861     10240.00
       1.708     0.999915        15861     11702.86
       1.708     0.999927        15861     13653.33
       3.813     0.999939        15862     16384.00
       3.813     1.000000        15862          inf
#[Mean    =        0.585, StdDeviation   =        0.107]
#[Max     =        3.812, Total count    =        15862]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  23659 requests in 30.00s, 4.49MB read
  Socket errors: connect 0, read 0, write 0, timeout 57
Requests/sec:    788.57  
Transfer/sec:    153.25KB